In [78]:
import pandas as pd

In [79]:
# Filtering based upon condition
df = pd.read_excel("Excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [80]:
# Filter all the records where salary > 100000
df[df.salary > 100000]

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
493  494     Sophia  39.0             Doctor  174500
495  496       John  45.0              Boxer  137929
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[304 rows x 5 columns]

In [81]:
# Filter all records where salary > 100000 and(&) salary < 150000
df[(df.salary > 100000) & (df.salary < 150000)]

      ID       Name   Age         Profession  salary
1      2  sophia     20.0              Boxer  119572
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
5      4      Rocky  56.0               Chef  117920
6      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
469  470     Sophia  42.0  Software Engineer  102357
480  481   Sherlock  22.0          Detective  126604
483  484     Olivia  59.0             Artist  124648
491  492       Emma  34.0             Artist  145412
495  496       John  45.0              Boxer  137929

[151 rows x 5 columns]

In [82]:
# Query: filter all the reports where the salary < 100000 or(|) salary > 150000
df[(df.salary < 100000) | (df.salary > 150000)]

      ID      Name   Age         Profession  salary
0      1    olivia  23.0            Teacher  184518
2      3      jake  38.0          Scientist  174897
10    11     Rocky   NaN             Doctor   75543
11    12      Jake   NaN             Artist  174780
13    14      John  46.0             Artist   43078
..   ...       ...   ...                ...     ...
494  495     Rocky  27.0             Doctor   46975
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[349 rows x 5 columns]

In [83]:
# Query: print the record of the person who is having the highest/max salary
df[df.salary == df.salary.max()]

      ID      Name   Age   Profession  salary
436  437  Sherlock  52.0        Boxer  199529

In [84]:
# Query: print the record of the person who is having the Lowest/min salary
df[df.salary == df.salary.min()]

      ID      Name   Age Profession  salary
213  214  Sherlock  21.0       Chef   30164

In [85]:
# Where() function for filtering the data
# where() function is returning those records which are satisfying the condition, 
# other reports are updated as NaN
df2 = df.copy()
df2.Age = df2.Age.where(df2.Age > 50,16)
df2

      ID       Name   Age         Profession  salary
0      1     olivia  16.0            Teacher  184518
1      2  sophia     16.0              Boxer  119572
2      3       jake  16.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  16.0              Boxer  137929
496  497   Sherlock  16.0              Boxer   39870
497  498   Sherlock  16.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

### Indexing/Slicing using loc and iloc objects

In [86]:
df.loc[1:4,'ID':'Age']

   ID       Name   Age
1   2  sophia     20.0
2   3       jake  38.0
3   4      Rocky  56.0
4   4      Rocky  56.0

In [87]:
df.loc[3:10,['ID',"Profession",'Age']]

    ID Profession   Age
3    4       Chef  56.0
4    4       Chef  56.0
5    4       Chef  56.0
6    4       Chef  56.0
7    4       Chef  56.0
8    4       Chef  56.0
9    4       Chef  56.0
10  11     Doctor   NaN

In [88]:
df.iloc[3:11,0:4]

    ID   Name   Age Profession
3    4  Rocky  56.0       Chef
4    4  Rocky  56.0       Chef
5    4  Rocky  56.0       Chef
6    4  Rocky  56.0       Chef
7    4  Rocky  56.0       Chef
8    4  Rocky  56.0       Chef
9    4  Rocky  56.0       Chef
10  11  Rocky   NaN     Doctor

In [89]:
# iloc is more faster than the loc as loc in backend is converted to index to work on
# loc uses column names to slice
# iloc uses index values to slice
# iloc is more comfortable than the loc
# iloc's last index is excluded

In [90]:
df.iloc[1:6,[0,1,4]]

   ID       Name  salary
1   2  sophia     119572
2   3       jake  174897
3   4      Rocky  117920
4   4      Rocky  117920
5   4      Rocky  117920

In [91]:
# combining loc & iloc with conditional statement
df.loc[df.Age > 50, 'ID':'Age']

      ID      Name   Age
3      4     Rocky  56.0
4      4     Rocky  56.0
5      4     Rocky  56.0
6      4     Rocky  56.0
7      4     Rocky  56.0
..   ...       ...   ...
489  490      John  56.0
490  491      John  57.0
492  493      John  55.0
498  499    Olivia  55.0
499  500  Sherlock  59.0

[126 rows x 3 columns]

In [92]:
# Query: Print those records where Age > 50 & Age < 60
df.loc[(df.Age > 50) & (df.Age < 60),'ID':'Age']

      ID      Name   Age
3      4     Rocky  56.0
4      4     Rocky  56.0
5      4     Rocky  56.0
6      4     Rocky  56.0
7      4     Rocky  56.0
..   ...       ...   ...
489  490      John  56.0
490  491      John  57.0
492  493      John  55.0
498  499    Olivia  55.0
499  500  Sherlock  59.0

[111 rows x 3 columns]

In [93]:
# Query: Print all records where age > 50 using iloc
df.iloc[(df.Age > 50).values,0:]

      ID      Name   Age         Profession  salary
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
5      4     Rocky  56.0               Chef  117920
6      4     Rocky  56.0               Chef  117920
7      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
489  490      John  56.0          Scientist   41192
490  491      John  57.0              Pilot  154180
492  493      John  55.0             Artist   57720
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[126 rows x 5 columns]

### Update the dataset using loc & iloc

In [94]:
df1 = df.copy()

In [95]:
# Query: we want to make the people young, change age of 50 - 60 years = 16
# here specifying "Age" is important because if not mentioned it will update
# to all columns as 16 where the age condition is met.
df1.loc[(df1.Age >= 50) & (df1.Age <= 60),"Age"] = 16
df1

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  16.0               Chef  117920
4      4      Rocky  16.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  16.0           Comedian  192618
499  500   Sherlock  16.0  Software Engineer  194886

[500 rows x 5 columns]

In [96]:
df1.Age.unique()

array([23., 20., 38., 16., nan, 22., 46., 40., 30., 25., 41., 42., 48.,
       21., 27., 45., 44., 32., 39., 26., 34., 47., 36., 37., 49., 33.,
       28., 31., 43., 29., 24., 35.])

In [97]:
# Updating the single value in dataset using loc
df.loc[df.ID == 500,'Name'] = 'Shreyas'
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500    Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [98]:
df.loc[0,'Name'] = 'Prabhas'
df

      ID       Name   Age         Profession  salary
0      1    Prabhas  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500    Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [99]:
# Updating the single value in dataset using iloc
df.iloc[0,1] = "Ajith"
df

      ID       Name   Age         Profession  salary
0      1      Ajith  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500    Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [100]:
df.at[1,'Name'] = 'Samantha'
df

      ID      Name   Age         Profession  salary
0      1     Ajith  23.0            Teacher  184518
1      2  Samantha  20.0              Boxer  119572
2      3      jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500   Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [101]:
df.iat[2,1] = 'John'
df

      ID      Name   Age         Profession  salary
0      1     Ajith  23.0            Teacher  184518
1      2  Samantha  20.0              Boxer  119572
2      3      John  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500   Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [102]:
# sorting of dataset and changing the index of dataset
df.sort_values('Age',ascending = False).head(20) # by default is ascending

      ID      Name   Age         Profession  salary
280  281      Liam  60.0             Artist  177074
75    76     Alice  60.0             Doctor  193629
63    64     Alice  60.0          Scientist   87383
39    40    Olivia  60.0  Software Engineer   32286
24    25    Olivia  60.0          Detective  182185
345  346     Alice  60.0           Comedian  104236
159  160      Emma  60.0             Doctor   31209
183  184  Mr. Bean  60.0              Pilot  130981
368  369      John  60.0             Doctor   82458
150  151  Sherlock  60.0          Scientist  135857
134  135      Emma  60.0          Detective   84536
193  194    Sophia  60.0  Software Engineer   69353
227  228      Emma  60.0               Chef  191492
100  101    Olivia  60.0            Teacher  163578
185  186      Liam  60.0               Chef   44743
226  227    Olivia  59.0          Detective  110055
119  120      Emma  59.0             Artist  182787
317  318     Rocky  59.0              Pilot   82474
116  117  Mr. Bean  59.0  Software Engineer  117660
447  448  Mr. Bean  59.0             Doctor   37507

In [103]:
# sorts based upon the ASCII value of the characters for the columns including strings
df.sort_values('Name',ascending = False).head(20)

      ID    Name   Age         Profession  salary
427  428  Sophia  26.0              Boxer  128217
348  349  Sophia  50.0           Comedian   84575
158  159  Sophia  43.0          Scientist  147010
292  293  Sophia  42.0              Boxer   34990
148  149  Sophia  32.0             Artist   33603
484  485  Sophia  57.0  Software Engineer  158682
458  459  Sophia  27.0           Comedian  114978
459  460  Sophia  32.0               Chef  148077
156  157  Sophia  25.0               Chef  114069
193  194  Sophia  60.0  Software Engineer   69353
53    54  Sophia  34.0          Detective   53088
82    83  Sophia  57.0  Software Engineer  170685
190  191  Sophia  34.0             Artist  112912
462  463  Sophia  32.0          Detective   31851
465  466  Sophia  37.0          Detective  160158
338  339  Sophia  32.0          Detective  181192
475  476  Sophia  41.0              Pilot  154805
474  475  Sophia  30.0             Doctor  198653
298  299  Sophia  49.0               Chef  142053
43    44  Sophia  51.0            Teacher  172273

In [104]:
df

      ID      Name   Age         Profession  salary
0      1     Ajith  23.0            Teacher  184518
1      2  Samantha  20.0              Boxer  119572
2      3      John  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500   Shreyas  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [105]:
df.set_index("ID") # index is changed to ID column

         Name   Age         Profession  salary
ID
1       Ajith  23.0            Teacher  184518
2    Samantha  20.0              Boxer  119572
3        John  38.0          Scientist  174897
4       Rocky  56.0               Chef  117920
4       Rocky  56.0               Chef  117920
..        ...   ...                ...     ...
496      John  45.0              Boxer  137929
497  Sherlock  46.0              Boxer   39870
498  Sherlock  47.0          Detective  165951
499    Olivia  55.0           Comedian  192618
500   Shreyas  59.0  Software Engineer  194886

[500 rows x 4 columns]

In [106]:
df.set_index('Age') # index is changed to Age

       ID      Name         Profession  salary
Age
23.0    1     Ajith            Teacher  184518
20.0    2  Samantha              Boxer  119572
38.0    3      John          Scientist  174897
56.0    4     Rocky               Chef  117920
56.0    4     Rocky               Chef  117920
...   ...       ...                ...     ...
45.0  496      John              Boxer  137929
46.0  497  Sherlock              Boxer   39870
47.0  498  Sherlock          Detective  165951
55.0  499    Olivia           Comedian  192618
59.0  500   Shreyas  Software Engineer  194886

[500 rows x 4 columns]

In [108]:
df = df.set_index('Age')
df

       ID      Name         Profession  salary
Age
23.0    1     Ajith            Teacher  184518
20.0    2  Samantha              Boxer  119572
38.0    3      John          Scientist  174897
56.0    4     Rocky               Chef  117920
56.0    4     Rocky               Chef  117920
...   ...       ...                ...     ...
45.0  496      John              Boxer  137929
46.0  497  Sherlock              Boxer   39870
47.0  498  Sherlock          Detective  165951
55.0  499    Olivia           Comedian  192618
59.0  500   Shreyas  Software Engineer  194886

[500 rows x 4 columns]

In [109]:
# getting back our default index
# inplace = True is used to reset the things in the same df without creating 
#the copy of the df to reset the values.
df.reset_index(inplace = True)

In [ ]:
df